blueskycoco/rt-thread/bsp/tm4c129x/applications/con_epi.c
	return 0;	
}
int _epi_send_config(rt_uint8_t *cmd,int len)
{
	int i=0;
	int crc=0;
	int result=0;
	//rt_uint8_t config_ip[]={0xF5,0x8A,0x00,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};
	len=sizeof(cmd);
	for(i=0;i<len-2;i++)
		crc=crc+cmd[i];
	cmd[len-2]=(crc>>8) & 0xff;
	cmd[len-1]=crc&0xff;
	memcpy((void *)g_pui8EPISdram,cmd,sizeof(cmd));
	Signal_To_B(len,1);
	rt_thread_delay(10);
	if(memcmp((void *)g_pui8EPISdram,(void *)COMMAND_OK, strlen(COMMAND_OK)))
	{
		rt_kprintf("Send Command ok\n");
		result=1;
	}
	else
		rt_kprintf("Send Command Failed\n");
	return result;
}
void _epi_read()
{
	rt_uint8_t *buf1,i;
	int len=0;
	len=g_pui8EPISdram[B_TO_A_SIGNAL]<<8|g_pui8EPISdram[A_TO_B_SIGNAL];
	unsigned char source=g_pui8EPISdram[CONFIG_ADDR];
	if(source==0)
	{
		if(phy_link&&g_socket[0].connected)
		{
			buf1 =(rt_uint8_t *)malloc(len*sizeof(rt_uint8_t));
			if(buf1==RT_NULL)
				rt_kprintf("buf is RT_NULL\r\n");
			rt_memcpy(buf1,(void *)g_pui8EPISdram,len);
			rt_data_queue_push(&g_data_queue[0],buf1, len, RT_WAITING_FOREVER);
		}
	}
	else
	{
		rt_uint8_t *p=(rt_uint8_t *)malloc(len*sizeof(rt_uint8_t));
		rt_memcpy(p,(const void *)g_pui8EPISdram,len);;
		if(p[0]==0xf5 && p[1]==0x8a)
		{		
			int check_sum=0,longlen=0;
			rt_kprintf("EPI Config len %d\r\n",len);
			for(i=0;i<len-2;i++)
			{
				rt_kprintf("%02x ",p[i]);
				check_sum+=p[i];
			}
			rt_kprintf("\r\n");
			if(check_sum==(p[len-2]<<8|p[len-1]))
			{
				if(p[2]==0x0c || p[2]==0x0d || p[2]==0x0e || p[2]==0x0f || p[2]==0x20)
					longlen=p[3]; 				
				//usb_config(p+2,longlen,0);
				set_config(p+2,longlen,0);
				memcpy((void *)g_pui8EPISdram,(void *)COMMAND_OK, strlen(COMMAND_OK));
				len=strlen(COMMAND_OK);
			}
			else
			{
				memcpy((void *)g_pui8EPISdram,(void *)COMMAND_FAIL, strlen(COMMAND_FAIL));
				len=strlen(COMMAND_FAIL);
			}
		}
		else if(p[0]==0xf5 && p[1]==0x8b)
		{
			rt_int32_t lenout;
			char *tmp=send_out(0,p[2],&lenout);
			if(tmp!=NULL)
			{
				int ii=0;
				for(ii=0;ii<lenout;ii++)
					rt_kprintf("%2x ",tmp[ii]);
				memcpy((void *)g_pui8EPISdram,(void *)tmp, lenout);
				len=lenout;
			}
			else
			{
				rt_kprintf("some error\r\n");
				memcpy((void *)g_pui8EPISdram,(void *)COMMAND_FAIL, strlen(COMMAND_FAIL));
				len=strlen(COMMAND_FAIL);
			}
		}
	}
	g_pui8EPISdram[A_TO_B_SIGNAL]=0x00;
	g_pui8EPISdram[B_TO_A_SIGNAL]=0x00;
	if(source)
		Signal_To_B(len,1);
	return ;	
}
void uDMAErrorHandler(void)
{
    uint32_t ui32Status;

    //
    // Check for uDMA error bit
    //
    ui32Status = MAP_uDMAErrorStatusGet();

    //
    // If there is a uDMA error, then clear the error and increment
    // the error counter.
    //
    if(ui32Status)
    {
        MAP_uDMAErrorStatusClear();
        //g_ui32uDMAErrCount++;
        rt_kprintf("uDMA Error intr.\n");
    }
}

void uDMAIntHandler(void)
{
    uint32_t ui32Mode;

    //
    // Check for the primary control structure to indicate complete.
    //
    ui32Mode = MAP_uDMAChannelModeGet(UDMA_CHANNEL_SW);
    if(ui32Mode == UDMA_MODE_STOP)
    {
        //
        // Increment the count of completed transfers.
        //
        //g_ui32MemXferCount++;

        //
        // Configure it for another transfer.
        //
        //ROM_uDMAChannelTransferSet(UDMA_CHANNEL_SW, UDMA_MODE_AUTO,
        //                           g_ui32SrcBuf, g_ui32DstBuf,
        //                           MEM_BUFFER_SIZE);

        //
        // Initiate another transfer.
        //
        //ROM_uDMAChannelEnable(UDMA_CHANNEL_SW);
        //ROM_uDMAChannelRequest(UDMA_CHANNEL_SW);
        //rt_kprintf("uDMA done.\n");
        rt_sem_release(&udma_sem);
    }

    //
    // If the channel is not stopped, then something is wrong.
    //
    else
    {
        //g_ui32BadISR++;
        rt_kprintf("uDMA Bad intr.\n");
    }
}
void InitSWTransfer(uint32_t dest,uint32_t src,uint32_t len)
{

    //
    // Enable interrupts from the uDMA software channel.
    //
    MAP_IntEnable(INT_UDMA);

    //
    // Put the attributes in a known state for the uDMA software channel.
    // These should already be disabled by default.
    //
    MAP_uDMAChannelAttributeDisable(UDMA_CHANNEL_SW,
                                    UDMA_ATTR_USEBURST | UDMA_ATTR_ALTSELECT |
                                    (UDMA_ATTR_HIGH_PRIORITY |
                                    UDMA_ATTR_REQMASK));

    //
    // Configure the control parameters for the SW channel.  The SW channel
    // will be used to transfer between two memory buffers, 32 bits at a time.
    // Therefore the data size is 32 bits, and the address increment is 32 bits
    // for both source and destination.  The arbitration size will be set to 8,
    // which causes the uDMA controller to rearbitrate after 8 items are
    // transferred.  This keeps this channel from hogging the uDMA controller
    // once the transfer is started, and allows other channels cycles if they
    // are higher priority.
    //
    MAP_uDMAChannelControlSet(UDMA_CHANNEL_SW | UDMA_PRI_SELECT,
                              UDMA_SIZE_32 | UDMA_SRC_INC_32 | UDMA_DST_INC_32 |
                              UDMA_ARB_8);

    //
    // Set up the transfer parameters for the software channel.  This will
    // configure the transfer buffers and the transfer size.  Auto mode must be
    // used for software transfers.
    //
    MAP_uDMAChannelTransferSet(UDMA_CHANNEL_SW | UDMA_PRI_SELECT,
                               UDMA_MODE_AUTO, (void *)src, (void *)dest,
                               len);

    //
    // Now the software channel is primed to start a transfer.  The channel
    // must be enabled.  For software based transfers, a request must be
    // issued.  After this, the uDMA memory transfer begins.
    //
    MAP_uDMAChannelEnable(UDMA_CHANNEL_SW);
    MAP_uDMAChannelRequest(UDMA_CHANNEL_SW);
	rt_sem_take(&udma_sem, RT_WAITING_FOREVER);
}
void epi_w_thread(void* parameter)
{
	rt_int32_t dev=((rt_int32_t)parameter)/2;
	rt_kprintf("epi_w_thread %d\r\n",dev);
	while(1)
	{
		if (rt_sem_take(&(rx_sem[0]), RT_WAITING_FOREVER) != RT_EOK) 
			continue;
		_epi_read();
	}	
}
void bus_speed_test(void *param)
{
	rt_uint8_t config_ip[]={0xF5,0x8A,0x00,0xc0,0xa8,0x01,0x67,0x26,0xfa,0x00,0x00};
	rt_int8_t buf[1022]={0};
	long times=102601;
	long i=0;
	memset(buf,0x38,1022);
	for(i=33;i<127;i++)
		buf[i-33]=i;
	for(i=1;i<11;i++)
	memcpy(buf+93*i+1,buf,93);
	memcpy(buf+931,buf,91);
	while(start_bus_speed==0)
		rt_thread_delay(1);
	rt_kprintf("start bus speed test\n");
	rt_hw_led_on();
	for(i=0;i<times;i++)
		_epi_write(0,buf,1022,0);
	rt_hw_led_off();
	rt_kprintf("end test\n");
	config_ip[6]=config_ip[6]+1;
	_epi_send_config(config_ip,sizeof(config_ip));
}
void IntGpioJ()
{
	if(MAP_GPIOIntStatus(GPIO_PORTJ_BASE, RT_TRUE)&GPIO_PIN_0)
	{		
		MAP_GPIOIntClear(GPIO_PORTJ_BASE, GPIO_PIN_0);
		//rt_kprintf("gpioj 0 int \r\n");
		start_bus_speed=1;
	}	
}

